mgt_6203/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-27 Fri 11:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MGT 6203: Data Analytics in Business</title>
<meta name="author" content="W" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">MGT 6203: Data Analytics in Business</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org32e59c2">1. Module 01: Linear Regression</a>
<ul>
<li><a href="#orgb9316a6">1.1. Steps in Regression Analysis</a>
<ul>
<li><a href="#orgfa3fe0b">1.1.1. Business examples (Dependent vs independent variables)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org32e59c2" class="outline-2">
<h2 id="org32e59c2"><span class="section-number-2">1.</span> Module 01: Linear Regression</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb9316a6" class="outline-3">
<h3 id="orgb9316a6"><span class="section-number-3">1.1.</span> Steps in Regression Analysis</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>State problem</li>
<li>Use regression for:
<ul class="org-ul">
<li>Diagnostic, or</li>
<li>Predictive, or</li>
<li>Prescriptive analytics?</li>
</ul></li>
<li>Select relevant response and explanatory variables</li>
<li>Collect data
<ul class="org-ul">
<li>Internal</li>
<li>External</li>
<li>Purchased</li>
<li>Experiment</li>
</ul></li>
<li>Choose fitting method
<ul class="org-ul">
<li>Ordinary least squares (OLS)</li>
<li>Generalized least squares</li>
<li>Maximum likelihood</li>
</ul></li>
<li>Fit model</li>
<li>Validate model with diagnostics</li>
<li>Refine and iterate from step 3</li>
<li>Use model</li>
</ol>
</div>
<div id="outline-container-orgfa3fe0b" class="outline-4">
<h4 id="orgfa3fe0b"><span class="section-number-4">1.1.1.</span> Business examples (Dependent vs independent variables)</h4>
<div class="outline-text-4" id="text-1-1-1">
<dl class="org-dl">
<dt>Used car price</dt><dd>odometer reading, age of car, condition</dd>
<dt>Sales</dt><dd>ad spend</dd>
<dt>Time taken to repair product</dt><dd>experience of technician</dd>
<dt>Product added to shopping card</dt><dd>ratings/price</dd>
<dt>Starting salary of new employee</dt><dd>work and education experience</dd>
<dt>Sale price of house</dt><dd>square feet, bedrooms, location</dd>
<dt>Customer default?</dt><dd>Credit score, income, age</dd>
<dt>Customer churn?</dt><dd>Length of contract, age of customer</dd>
</dl>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: W</p>
<p class="date">Created: 2023-01-27 Fri 11:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
